---
kind: property
id: P:Autodesk.Revit.DB.ScheduleFilter.IsIntegerValue
source: html/7e3e7135-4c1a-2c8b-1e77-15dcf80ec72e.htm
---
# Autodesk.Revit.DB.ScheduleFilter.IsIntegerValue Property

Indicates if the filter has an integer value.

## Syntax (C#)
```csharp
public bool IsIntegerValue { get; }
```